Revit 2026 API
RebarConstraintsManager.ClearHandleConstraintPairHighlighting Method
 Clears all highlighting in all views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void ClearHandleConstraintPairHighlighting(
	Document aDoc
)
Public Sub ClearHandleConstraintPairHighlighting (
	aDoc As Document
)
public:
void ClearHandleConstraintPairHighlighting(
	Document^ aDoc
)
member ClearHandleConstraintPairHighlighting :
        aDoc : Document -> unit
Parameters
aDoc Document
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If highlightHandleConstraintPairInAllViews has been called, then this method can be used to remove all highlighting.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace